src/Documents/Выписка/Выписка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Выписка</name>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетОрганизации</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеОплачиватьЗаявки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеВыписки</name>
    <attributes>
      <name>СтатьяДДС</name>
      <type>
        <types>CatalogRef.СтатьиДДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетКонтрагента</name>
      <type>
        <types>CatalogRef.БанковскиеСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПриход</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасход</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютнаяСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеПлатежа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>800</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияОперации</name>
      <type>
        <types>CatalogRef.КатегорииОпераций</types>
      </type>
    </attributes>
    <attributes>
      <name>GUIDСтрокиФинансовогоПлана</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаЗаявки</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>GUIDСтрокиВыписки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаявки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IDЗаявки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УправленческийУчет</name>
    <attributes>
      <name>GUIDСтрокиВыписки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.РеквизитыУправленческогоУчета</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипРеквизита</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗапретРедактирования</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Необязательный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПараметра</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.РеквизитыУправленческогоУчета</types>
      </type>
    </attributes>
    <attributes>
      <name>Формула</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/СостоянияСтрокДокументов/СостоянияСтрокДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияСтрокДокументов</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияСтрокДокументов</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DefinedType.ДокументыСостоянияСтрок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>GUIDСтроки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/AccumulationRegisters/ДенежныеСредства/ДенежныеСредства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДенежныеСредства</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиДДС</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>800</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетКонтрагента</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/СостоянияСтрокДокументов/СостоянияСтрокДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияСтрокДокументов</name>
  <enumValues>
    <name>Оплачено</name>
  </enumValues>
  <enumValues>
    <name>НеОплачено</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ФинансовыйПлан/ФинансовыйПлан.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ФинансовыйПлан</name>
  <registerRecords>AccumulationRegister.ПланируемаяОплатаЗаявок</registerRecords>
  <registerRecords>AccumulationRegister.ПланируемыеДвижения</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Планирование</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетОрганизации</name>
      <type>
        <types>CatalogRef.БанковскиеСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДДС</name>
      <type>
        <types>CatalogRef.СтатьиДДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетКонтрагента</name>
      <type>
        <types>CatalogRef.БанковскиеСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеПлатежа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>800</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаЗаявки</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютнаяСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияОперации</name>
      <type>
        <types>CatalogRef.КатегорииОпераций</types>
      </type>
    </attributes>
    <attributes>
      <name>Процент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КурсОплатыФиксированный</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтменаПлатежа</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОплатаВыполнена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>АвторСтроки</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаявки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GUIDСтрокиФинансовогоПлана</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IDЗаявки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаявкаВзятаВРаботу</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УправленческийУчетЗаявок</name>
    <attributes>
      <name>GUIDСтрокиФинансовогоПлана</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.РеквизитыУправленческогоУчета</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипРеквизита</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗапретРедактирования</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Необязательный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПараметра</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.РеквизитыУправленческогоУчета</types>
      </type>
    </attributes>
    <attributes>
      <name>Формула</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/Выписка/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Оплачиваем заявки
	
	СоединениеАДО = ЗапросыЧерезАДО.ПолучитьСоединениеАДО("Fin_Request");
	
	МассивGUIDовСтрокФинПлана = Новый Массив;
	
	
	Для Каждого СтрокаТЧ ИЗ ДанныеВыписки Цикл
		
		Если СтрокаТЧ.СтатьяДДС = Справочники.СтатьиДДС.Приход Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ НеОплачиватьЗаявки И ЗначениеЗаполнено(СтрокаТЧ.НомерЗаявки) Тогда
			РаботаСЗаявкамиСервер.SQL_ОплатитьЗаявку(СоединениеАДО, СтрокаТЧ.IDЗаявки, Истина, Дата, СтрокаТЧ.СуммаРасход, "", "", "");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТЧ.GUIDСтрокиФинансовогоПлана) Тогда
			МассивGUIDовСтрокФинПлана.Добавить(СтрокаТЧ.GUIDСтрокиФинансовогоПлана);
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ФинансовыйПланПланирование.Ссылка КАК ФинансовыйПлан,
	|	ФинансовыйПланПланирование.GUIDСтрокиФинансовогоПлана КАК GUIDСтрокиФинансовогоПлана
	|ИЗ
	|	Документ.ФинансовыйПлан.Планирование КАК ФинансовыйПланПланирование
	|ГДЕ
	|	ФинансовыйПланПланирование.GUIDСтрокиФинансовогоПлана В(&МассивGUIDовСтрокФинПлана)
	|	И НАЧАЛОПЕРИОДА(ФинансовыйПланПланирование.Ссылка.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	|ИТОГИ ПО
	|	ФинансовыйПлан";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("МассивGUIDовСтрокФинПлана", МассивGUIDовСтрокФинПлана);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаФинансовыйПлан = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаФинансовыйПлан.Следующий() Цикл
		
		//ФинансовыйПланОбъект = ВыборкаФинансовыйПлан.ФинансовыйПлан.ПолучитьОбъект();
		
		Выборка = ВыборкаФинансовыйПлан.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			//Если ЗначениеЗаполнено(Выборка.GUIDСтрокиФинансовогоПлана) Тогда
			//	
			//	Для Каждого СтрокаТЧ Из ФинансовыйПланОбъект.Планирование.НайтиСтроки(Новый Структура("GUIDСтрокиФинансовогоПлана", Выборка.GUIDСтрокиФинансовогоПлана)) Цикл
			//		СтрокаТЧ.ОплатаВыполнена = Истина;
			//	КонецЦикла;
			//	
			//КонецЕсли;
			
			Если ЗначениеЗаполнено(Выборка.GUIDСтрокиФинансовогоПлана) Тогда
				Запись = РегистрыСведений.СостоянияСтрокДокументов.СоздатьМенеджерЗаписи();
				Запись.Документ = ВыборкаФинансовыйПлан.ФинансовыйПлан;
				Запись.GUIDСтроки = Выборка.GUIDСтрокиФинансовогоПлана;
				Запись.Состояние = Перечисления.СостоянияСтрокДокументов.Оплачено;
				Запись.Записать(Истина);
			КонецЕсли;
			
		КонецЦикла;
		
		//ФинансовыйПланОбъект.Записать();
		
	КонецЦикла;
	
	Движения.ДенежныеСредства.Записывать = Истина;
	
	Если Валюта = Справочники.Валюты.РоссийскийРубль Тогда
		
		Для Каждого СтрокаТЧ ИЗ ДанныеВыписки Цикл
			
			
			Сумма = СтрокаТЧ.СуммаПриход - СтрокаТЧ.СуммаРасход;
			
			Если Сумма > 0 Тогда
				Движение = Движения.ДенежныеСредства.ДобавитьПриход();
				Движение.Сумма = Сумма;
			Иначе
				Движение = Движения.ДенежныеСредства.ДобавитьРасход();
				Движение.Сумма = -Сумма;
			КонецЕсли;
			
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.БанковскийСчет = СчетОрганизации;
			Движение.Контрагент = СтрокаТЧ.Контрагент;
			Движение.СчетКонтрагента = СтрокаТЧ.СчетКонтрагента;
			Движение.СтатьяДДС = СтрокаТЧ.СтатьяДДС;
			Движение.НазначениеПлатежа = СтрокаТЧ.НазначениеПлатежа;
			
			
		КонецЦикла;
		
	Иначе
		
		Для Каждого СтрокаТЧ Из ДанныеВыписки Цикл
			
			Если СтрокаТЧ.СуммаПриход - СтрокаТЧ.СуммаРасход > 0 Тогда

				ВалютнаяСумма = СтрокаТЧ.ВалютнаяСумма;
				Движение = Движения.ДенежныеСредства.ДобавитьПриход();
				Движение.Сумма = ВалютнаяСумма;
				
			Иначе
				ВалютнаяСумма = СтрокаТЧ.ВалютнаяСумма;
				Движение = Движения.ДенежныеСредства.ДобавитьРасход();
				Движение.Сумма = ВалютнаяСумма;
			КонецЕсли;
			
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.БанковскийСчет = СчетОрганизации;
			Движение.Контрагент = СтрокаТЧ.Контрагент;
			Движение.СчетКонтрагента = СтрокаТЧ.СчетКонтрагента;
			Движение.СтатьяДДС = СтрокаТЧ.СтатьяДДС;
			Движение.НазначениеПлатежа = СтрокаТЧ.НазначениеПлатежа;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;
	
	СоединениеАДО = ЗапросыЧерезАДО.ПолучитьСоединениеАДО("Fin_Request");
	
	МассивGUIDовСтрокФинПлана = Новый Массив;
	
	Для Каждого СтрокаТЧ ИЗ ДанныеВыписки Цикл
		
		Если СтрокаТЧ.СтатьяДДС = Справочники.СтатьиДДС.Приход Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТЧ.НомерЗаявки) Тогда
			
			Если НЕ НеОплачиватьЗаявки Тогда
				РаботаСЗаявкамиСервер.SQL_ОтменитьОплатуЗаявки(СоединениеАДО, СтрокаТЧ.IDЗаявки);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТЧ.GUIDСтрокиФинансовогоПлана) Тогда
			МассивGUIDовСтрокФинПлана.Добавить(СтрокаТЧ.GUIDСтрокиФинансовогоПлана);
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ФинансовыйПланПланирование.Ссылка КАК ФинансовыйПлан,
	|	ФинансовыйПланПланирование.GUIDСтрокиФинансовогоПлана КАК GUIDСтрокиФинансовогоПлана
	|ИЗ
	|	Документ.ФинансовыйПлан.Планирование КАК ФинансовыйПланПланирование
	|ГДЕ
	|	ФинансовыйПланПланирование.GUIDСтрокиФинансовогоПлана В(&МассивGUIDовСтрокФинПлана)
	|	И НАЧАЛОПЕРИОДА(ФинансовыйПланПланирование.Ссылка.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	|ИТОГИ ПО
	|	ФинансовыйПлан";

	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("МассивGUIDовСтрокФинПлана", МассивGUIDовСтрокФинПлана);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаФинансовыйПлан = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаФинансовыйПлан.Следующий() Цикл
		
		//ФинансовыйПланОбъект = ВыборкаФинансовыйПлан.ФинансовыйПлан.ПолучитьОбъект();
		
		Выборка = ВыборкаФинансовыйПлан.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			//Для Каждого СтрокаТЧ Из ФинансовыйПланОбъект.Планирование.НайтиСтроки(Новый Структура("GUIDСтрокиФинансовогоПлана", Выборка.GUIDСтрокиФинансовогоПлана)) Цикл
			//	СтрокаТЧ.ОплатаВыполнена = Ложь;
			//КонецЦикла;
			
			Если ЗначениеЗаполнено(Выборка.GUIDСтрокиФинансовогоПлана) Тогда
				Запись = РегистрыСведений.СостоянияСтрокДокументов.СоздатьМенеджерЗаписи();
				Запись.Документ = ВыборкаФинансовыйПлан.ФинансовыйПлан;
				Запись.GUIDСтроки = Выборка.GUIDСтрокиФинансовогоПлана;
				Запись.Состояние = Перечисления.СостоянияСтрокДокументов.НеОплачено;
				Запись.Записать(Истина);
			КонецЕсли;
			
		КонецЦикла;
		
		//ФинансовыйПланОбъект.Записать();
		
	КонецЦикла;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ОчисткаСтрокУправленческогоУчета();
	
КонецПроцедуры

Процедура ОчисткаСтрокУправленческогоУчета()
	
	МассивСтрокНаУдаление = Новый Массив;
	Для Каждого СтрокаТЧ Из УправленческийУчет Цикл
		
		Если ДанныеВыписки.НайтиСтроки(Новый Структура("GUIDСтрокиВыписки", СтрокаТЧ.GUIDСтрокиВыписки)).Количество() = 0 Тогда
			МассивСтрокНаУдаление.Добавить(СтрокаТЧ);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Элемент Из МассивСтрокНаУдаление Цикл
		УправленческийУчет.Удалить(Элемент);
	КонецЦикла;
	
КонецПроцедуры
